Autodesk.Revit.DB.IEntitlementExternalServerProxy.HasCloudModelEntitlement(System.Boolean)
Checks if the current user has Non-workshared Cloud Model entitlement.
allowThrow:
True to throw exception
Returns:
Indicates whether the current user has Non-workshared Cloud Model entitlement
Since:
2019

Autodesk.Revit.DB.IEntitlementExternalServerProxy.HasWorksharedCloudModelEntitlement(System.Boolean)
Checks if the current user has Workshared Cloud Model entitlement.
allowThrow:
True to throw exception
Returns:
Indicates whether the current user has Workshared Cloud Model entitlement
Since:
2019